{
  "basic_information": {
    "scholarship_id": 146451,
    "scholarship_name": "Oklahoma Fallen Peace Officer and Firefighter Waiver",
    "scholarship_code": "",
    "scholarship_notes": "A. Within The Oklahoma State System of Higher Education, no resident tuition or nonresident tuition shall be charged to the: 1. Children of Oklahoma peace officers as defined by Section 648 of Title 21 of the Oklahoma Statutes who have given their lives in the line of duty; 2. Children of Oklahoma firefighters who have given their lives in the line of duty; 3. Children of members of the Oklahoma Law Enforcement Retirement System who have given their lives in the line of duty or whose disability is by means of personal and traumatic injury of a catastrophic nature, as defined by Section 2-300 of Title 47 of the Oklahoma Statutes, and occurred in the line of duty; and 4. Children of Oklahoma emergency medical technicians who have given their lives in the line of duty. B. Such waiver of resident tuition and nonresident tuition shall be limited to a period of five (5) years. C. Such waiver of resident tuition or nonresident tuition to the children of deceased peace officers and to the children of deceased firefighters as provided for in this section shall be a service benefit of each Oklahoma peace officer and Oklahoma firefighter. D. For purposes of this section: 1. \"Firefighter\" means a volunteer firefighter or a permanent salaried professional member of any fire department within the State of Oklahoma; and 2. \"Emergency medical technician\" means a person volunteering or employed as an emergency medical technician and who is licensed as an emergency medical technician pursuant to Section 1-2505 of Title 63 of the Oklahoma Statutes. OSRHE Title 70 Section 3218.7",
    "donor_name": "",
    "committee_name": "ESS General Awards",
    "candidate_count": 3
  },
  "renewable_information": {
    "is_renewable": true,
    "renewable_years": 5
  },
  "description": "Waiver for children of fallen Oklahoma peace/police officers, firefighters, and other 1st responder killed in the line of duty. Waives resident or nonresident charges. OSRHE Title 70 Section 3218.7",
  "qualifying_criteria": {
    "description": "Hard requirements that must be met to qualify for the scholarship",
    "criteria_count": 0,
    "criteria": []
  },
  "general_criteria": {
    "description": "Soft requirements that provide additional points/consideration",
    "criteria_count": 0,
    "criteria": [],
    "total_possible_points": 0
  },
  "conditional_criteria": {
    "description": "Requirements for scholarship renewal",
    "criteria_count": 0,
    "criteria": []
  },
  "metadata": {
    "processed_date": "2025-08-28T14:17:39.815439",
    "source_file": "ScholarshipswithCriteriaNextGen08202025.csv",
    "processing_notes": {
      "html_cleaned": true,
      "requirements_parsed": true,
      "criteria_categorized": true
    }
  }
}